Revit 2024 API
DocumentEntryPoint.Initialize Method
 For Revit Macros internal use only.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void Initialize(
	Object obj,
	string addinFolder
)
Visual Basic
Public Sub Initialize ( _
	obj As Object, _
	addinFolder As String _
)
Visual C++
public:
virtual void Initialize(
	Object^ obj,
	String^ addinFolder
) sealed
Parameters
obj
Type: System.Object
addinFolder
Type: System.String
Implements
IEntryPoint.Initialize(Object, String)
See Also
DocumentEntryPoint Class
Autodesk.Revit.DB.Macros Namespace